test/integration/artillery.yaml
config:
  target: "http://localhost:3000"
  phases:
    # - duration: 60
    #   arrivalRate: 5
    #   name: "slow start"
    - duration: 30
      arrivalRate: 5
      rampTo: 30
      name: "Warm up the application"
    - duration: 60
      arrivalRate: 30
      name: "Sustained max load"
  payload:
    path: "keywords.csv"
    fields:
      - "keywords"
scenarios:
  - name: "Home"
    weight: 100
    flow:
      - loop:
        - get:
            url: "/home?userId=123"
        count: 100
  - name: "Home and Search"
    weight: 25
    flow:
      - loop:
        - get:
            url: "/home?userId=123"
        - post:
            url: "/search"
            json:
              q: "{{ keywords }}"
        count: 100